<details ><summary>plan for core 2025-01-02 00:32:34 (UTC)</summary>
        <details ><summary>Locking successful</summary>
  Project LumeWeb/pinner.xyz-devops#core has been locked by PR #1
</details>

<details open="true"><summary>Plan output</summary>

```terraform
OpenTofu will perform the following actions:

  # cloudns_dns_record.renterd will be created
  + resource "cloudns_dns_record" "renterd" {
      + id    = (known after apply)
      + name  = "pinner-core-renterd-solo.node"
      + ttl   = 600
      + type  = "CNAME"
      + value = (known after apply)
      + zone  = "pinner.xyz"
    }

  # cloudns_dns_record.renterd_s3 will be created
  + resource "cloudns_dns_record" "renterd_s3" {
      + id    = (known after apply)
      + name  = "s3.pinner-core-renterd-solo.node"
      + ttl   = 600
      + type  = "CNAME"
      + value = (known after apply)
      + zone  = "pinner.xyz"
    }

  # module.etcd.module.etcd_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = []
        }
    }

  # module.mysql.module.mysql_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = []
        }
    }

  # module.renterd.module.renterd_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = []
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + etcd_endpoint       = (known after apply)
  + mysql_endpoint      = (known after apply)

─────────────────────────────────────────────────────────────────────────────
```
</details>


<details ><summary>Terraform plan validation check (core)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details ><summary>Plan summary</summary>
  
| CHANGE |                              RESOURCE                               |
|--------|---------------------------------------------------------------------|
| add    | `cloudns_dns_record.renterd`                                        |
|        | `cloudns_dns_record.renterd_s3`                                     |
|        | `module.etcd.module.etcd_deployment.akash_deployment.service`       |
|        | `module.mysql.module.mysql_deployment.akash_deployment.service`     |
|        | `module.renterd.module.renterd_deployment.akash_deployment.service` |

| CHANGE |      OUTPUT      |
|--------|------------------|
| add    | `etcd_endpoint`  |
|        | `mysql_endpoint` |

</details>

</details>